app/controllers/api/v1/finance_term_controller.rb

SELECT "finance_terms".* FROM "finance_terms" WHERE "finance_terms"."policy_id" IN (?, ?) LIMIT ?  [["policy_id", 2], ["policy_id", 3], ["LIMIT", 1]]
---
      def generate_terms
        policies = params[:policies]

        begin
          validation_res = InsurancePolicyImpl.validate_policies(policies)
          unless validation_res.result
            Rails.logger.error("#{self} | #{self.__method__} | error: #{validation_res.msg}")
            return send_error_response(nil, nil, validation_res.msg, INPUT_ERROR,:bad_request)
          end

          finance_terms = InsurancePolicyImpl.generate_finance_terms(policies)
          if finance_terms.blank?