app/models/finance_term.rb

INSERT INTO "finance_terms" ("policy_ids", "downpayment", "amt_financed", "due_date", "is_accepted", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"
SELECT "finance_terms".* FROM "finance_terms" WHERE "finance_terms"."insurance_policies_id" = ? LIMIT ?  [["insurance_policies_id", 1], ["LIMIT", 1]]
UPDATE "finance_terms" SET "is_accepted" = ?, "updated_at" = ? WHERE "finance_terms"."id" = ?  [["is_accepted", 0], ["updated_at", "2024-03-24 17:30:03.659474"], ["id", 2]]
---
  def self.create(finance_term_dto)
    finance_term = nil
    begin
      finance_term = FinanceTerm.find_or_initialize_by(insurance_policies_id: finance_term_dto.policy_id)
      finance_term.downpayment = finance_term_dto.downpayment
      finance_term.amt_financed = finance_term_dto.amt_financed
      finance_term.due_date = finance_term_dto.due_date
      finance_term.is_accepted = false
      finance_term.save!

SELECT "finance_terms".* FROM "finance_terms" WHERE "finance_terms"."id" = ? LIMIT ?  [["id", 23], ["LIMIT", 1]]
---
  def self.get_by_id(finance_term_id)
    finance_term = nil
    begin
      finance_term = FinanceTerm.find(finance_term_id)

UPDATE "finance_terms" SET "is_accepted" = ?, "updated_at" = ? WHERE "finance_terms"."id" = ?  [["is_accepted", 1], ["updated_at", "2024-03-24 16:08:29.091322"], ["id", 2]]
---
  def self.update_term_accepted(finance_term, is_accepted)
    begin
      finance_term.is_accepted = is_accepted
      finance_term.save!