app/models/insurance_policy.rb

INSERT INTO "insurance_policies" ("premium", "tax_fee", "insureds_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["premium", 300.0], ["tax_fee", 50.0], ["insureds_id", 1], ["created_at", "2024-03-24 03:07:02.272390"], ["updated_at", "2024-03-24 03:07:02.272390"]]
SELECT "insurance_policies".* FROM "insurance_policies" WHERE "insurance_policies"."insureds_id" = ? AND "insurance_policies"."premium" = ? AND "insurance_policies"."tax_fee" = ? LIMIT ?  [["insureds_id", 1], ["premium", 300.0], ["tax_fee", 50.0], ["LIMIT", 1]]
---
  def self.create(policy_db_dto)
    insurance_policy = nil
    begin
      insurance_policy = InsurancePolicy.find_or_initialize_by(insureds_id: policy_db_dto.insured_id,
                                                            premium: policy_db_dto.premium,
                                                            tax_fee: policy_db_dto.tax_fee)