app/models/insured.rb

INSERT INTO "insureds" ("name", "created_at", "updated_at") VALUES (?, ?, ?) RETURNING "id"  [["name", "Pru Kul"], ["created_at", "2024-03-24 02:56:17.631142"], ["updated_at", "2024-03-24 02:56:17.631142"]]
SELECT "insureds".* FROM "insureds" WHERE "insureds"."name" = ? LIMIT ?  [["name", "Pru Kul"], ["LIMIT", 1]]
---
  def self.create(insured_name)
    insured = nil
    begin
      insured = Insured.find_or_initialize_by(name: insured_name)